[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:112:37
               id="email"
               type="text"
               isInvalid={Boolean(errors.email)}
-              {...register("email", {
-                required: "Email is required.",
-                pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]/,
-                  message: "Invalid email address.",
-                },
-              })}
+              {...register("email", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/Articles/ArticlesForm.jsx:115:26
               {...register("email", {
                 required: "Email is required.",
                 pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]/,
+                  value: /^[^\s@]+@[^\s@]+\.[\s@]/,
                   message: "Invalid email address.",
                 },
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Invalid email address.
</div> instead

[Killed] Regex
main/components/Articles/ArticlesForm.jsx:115:26
               {...register("email", {
                 required: "Email is required.",
                 pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]/,
+                  value: /[^\s@]+@[^\s@]+\.[^\s@]/,
                   message: "Invalid email address.",
                 },
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Invalid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
