[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:42:5
       header: "title",
       accessorKey: "title",
     },
-    {
-      header: "url",
-      accessorKey: "url",
-    },
+    {},
     {
       header: "explanation",
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:43:15
       accessorKey: "title",
     },
     {
-      header: "url",
+      header: "",
       accessorKey: "url",
     },
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: url. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:48:20
     },
     {
       header: "explanation",
-      accessorKey: "explanation",
+      accessorKey: "",
     },
     {
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This article explains the sample fixture format.
Received:

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:50:5
       header: "explanation",
       accessorKey: "explanation",
     },
-    {
-      header: "email",
-      accessorKey: "email",
-    },
+    {},
     {
       header: "dateAdded",
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:54:5
       header: "email",
       accessorKey: "email",
     },
-    {
-      header: "dateAdded",
-      accessorKey: "dateAdded",
-    },
+    {},
   ];
 
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:56:20
     },
     {
       header: "dateAdded",
-      accessorKey: "dateAdded",
+      accessorKey: "",
     },
   ];
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2026-05-02T12:00:00
Received:
