[Killed] BooleanLiteral
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsEditPage.jsx:9:15
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonMenuItemsEditPage({
-  storybook = false,
+  storybook = true,
 }) {
   let { id } = useParams();
killedBy: UCSBDiningCommonMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsEditPage.jsx:30:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonMenuItem) => ({
-    url: "/api/ucsbdiningcommonmenuitems",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonMenuItem.name,
-      station: ucsbDiningCommonMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonMenuItem) => {
killedBy: UCSBDiningCommonMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonMenuItem Updated - id: 17 diningCommonsCode: dining commons code 1 name: name 1 station: station 1",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsEditPage.jsx:30:65
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonMenuItem) => ({
-    url: "/api/ucsbdiningcommonmenuitems",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonMenuItem.name,
-      station: ucsbDiningCommonMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = (ucsbDiningCommonMenuItem) => ({});
 
   const onSuccess = (ucsbDiningCommonMenuItem) => {
killedBy: UCSBDiningCommonMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonMenuItem Updated - id: 17 diningCommonsCode: dining commons code 1 name: name 1 station: station 1",

[Killed] StringLiteral
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsEditPage.jsx:32:13
 
   const objectToAxiosPutParams = (ucsbDiningCommonMenuItem) => ({
     url: "/api/ucsbdiningcommonmenuitems",
-    method: "PUT",
+    method: "",
     params: {
       id: ucsbDiningCommonMenuItem.id,
killedBy: UCSBDiningCommonMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonMenuItem</h1>
-        {ucsbDiningCommonMenuItem && (
-          <UCSBDiningCommonMenuItemForm
-            initialContents={ucsbDiningCommonMenuItem}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonMenuItemsEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonMenuItemForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonMenuItem</h1>
-        {ucsbDiningCommonMenuItem && (
-          <UCSBDiningCommonMenuItemForm
-            initialContents={ucsbDiningCommonMenuItem}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonMenuItemsEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonMenuItemForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
