[Killed] BlockStatement
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsIndexPage.jsx:12:30
 export default function UCSBDiningCommonMenuItemsIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbdiningcommonmenuitems/create"
-          style={{ float: "right" }}
-        >
-          Create UCSBDiningCommonMenuItem
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: UCSBDiningCommonMenuItemsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create UCSBDiningCommonMenuItem/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsIndexPage.jsx:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbdiningcommonmenuitems/create"
-          style={{ float: "right" }}
-        >
-          Create UCSBDiningCommonMenuItem
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: UCSBDiningCommonMenuItemsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create UCSBDiningCommonMenuItem/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsIndexPage.jsx:33:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsbdiningcommonmenuitems/all"],
-    { method: "GET", url: "/api/ucsbdiningcommonmenuitems/all" },
+    { method: "", url: "/api/ucsbdiningcommonmenuitems/all" },
     [],
   );
killedBy: UCSBDiningCommonMenuItemsIndexPage tests renders empty table when backend unavailable, user only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] StringLiteral
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsIndexPage.jsx:33:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsbdiningcommonmenuitems/all"],
-    { method: "GET", url: "/api/ucsbdiningcommonmenuitems/all" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: UCSBDiningCommonMenuItemsIndexPage tests renders three menu items correctly for regular user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonMenuItemsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
