[Killed] BlockStatement
main/components/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsTable.jsx:18:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsbdiningcommonmenuitems/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "vi.fn()" to be called with arguments: [ '/ucsbdiningcommonmenuitems/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsTable.jsx:45:5
       header: "Dining Commons Code",
       accessorKey: "diningCommonsCode",
     },
-    {
-      header: "Dining Commons Menu Item",
-      accessorKey: "diningCommonsMenuItem",
-    },
+    {},
     {
       header: "Station",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsTable.jsx:46:15
       accessorKey: "diningCommonsCode",
     },
     {
-      header: "Dining Commons Menu Item",
+      header: "",
       accessorKey: "diningCommonsMenuItem",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Dining Commons Menu Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonMenuItemsTable"

[Killed] BlockStatement
main/components/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsTable.jsx:55:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "UCSBDiningCommonMenuItemsTable",
-      ),
-    );
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "UCSBDiningCommonMenuItemsTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonMenuItemsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonMenuItemsTable"
