[Killed] ArrowFunction
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsCreatePage.jsx:10:31
 export default function UCSBDiningCommonMenuItemsCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (ucsbDiningCommonMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: ucsbDiningCommonMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonMenuItem.name,
-      station: ucsbDiningCommonMenuItem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonMenuItem) => {
killedBy: UCSBDiningCommonMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsCreatePage.jsx:11:10
   storybook = false,
 }) {
   const objectToAxiosParams = (ucsbDiningCommonMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems/post",
+    url: "",
     method: "POST",
     params: {
killedBy: UCSBDiningCommonMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New ucsbDiningCommonMenuItem Created - id: 17 diningCommonsCode: dining commons code 1 name: name 1 station: station 1",
