[Killed] ArrowFunction
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsEditPage.jsx:30:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonMenuItem.name,
-      station: ucsbDiningCommonMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonMenuItem) => {
killedBy: UCSBDiningCommonMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonMenuItem Updated - id: 17 diningCommonsCode: dining commons code 1 name: name 1 station: station 1",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemsEditPage.jsx:30:65
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonMenuItem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonMenuItem.name,
-      station: ucsbDiningCommonMenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = (ucsbDiningCommonMenuItem) => ({});
 
   const onSuccess = (ucsbDiningCommonMenuItem) => {
killedBy: UCSBDiningCommonMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonMenuItem Updated - id: 17 diningCommonsCode: dining commons code 1 name: name 1 station: station 1",
