[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:46:5
       header: "Requester Email",
       accessorKey: "requesterEmail",
     },
-    {
-      header: "Team ID",
-      accessorKey: "teamId",
-    },
+    {},
     {
       header: "Table or Breakout Room",
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:47:15
       accessorKey: "requesterEmail",
     },
     {
-      header: "Team ID",
+      header: "",
       accessorKey: "teamId",
     },
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Team ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:54:5
       header: "Table or Breakout Room",
       accessorKey: "tableOrBreakoutRoom",
     },
-    {
-      header: "Request Time",
-      accessorKey: "requestTime",
-    },
+    {},
     {
       header: "Explanation",
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header
