[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:9:10
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationRequest/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New RecommendationRequest Created - id: 1 requesterEmail: alex.johnson@ucsb.edu",

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:10:13
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (recommendationRequest) => ({
     url: "/api/recommendationRequest/post",
-    method: "POST",
+    method: "",
     params: {
       requesterEmail: recommendationRequest.requesterEmail,
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
