[Killed] ArrowFunction
main/components/MenuItemReview/MenuItemReviewForm.jsx:49:25
           isInvalid={Boolean(errors.itemId)}
           {...register("itemId", {
             required: "Item Id is required.",
-            setValueAs: (v) => String(v),
+            setValueAs: () => undefined,
           })}
         />
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/MenuItemReview/MenuItemReviewForm.jsx:98:25
               value: 5,
               message: "Stars must be at most 5.",
             },
-            setValueAs: (v) => String(v),
+            setValueAs: () => undefined,
           })}
         />
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Stars must be at least 1./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
