[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:41:15
       accessorKey: "itemId",
     },
     {
-      header: "Reviewer Email",
+      header: "",
       accessorKey: "reviewerEmail",
     },
killedBy: MenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Reviewer Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"
