[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item Review</h1>
-        {menuItemReview && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...menuItemReview,
-              dateReviewed: menuItemReview.dateReviewed?.substring(0, 16),
-            }}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item Review</h1>
-        {menuItemReview && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...menuItemReview,
-              dateReviewed: menuItemReview.dateReviewed?.substring(0, 16),
-            }}
-          />
-        )}
+        {menuItemReview || <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={{
+  ...menuItemReview,
+  dateReviewed: menuItemReview.dateReviewed?.substring(0, 16)
+}} />}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Cannot read properties of undefined (reading 'dateReviewed')

[Survived] MethodExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:76:29
             buttonLabel={"Update"}
             initialContents={{
               ...menuItemReview,
-              dateReviewed: menuItemReview.dateReviewed?.substring(0, 16),
+              dateReviewed: menuItemReview.dateReviewed,
             }}
           />

[Survived] OptionalChaining
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:76:29
             buttonLabel={"Update"}
             initialContents={{
               ...menuItemReview,
-              dateReviewed: menuItemReview.dateReviewed?.substring(0, 16),
+              dateReviewed: menuItemReview.dateReviewed.substring(0, 16),
             }}
           />
