[Killed] LogicalOperator
main/components/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemForm.jsx:26:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonMenuItemForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBDiningCommonMenuItemForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: UCSBDiningCommonMenuItemForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonMenuItems/UCSBDiningCommonMenuItemForm.jsx:26:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonMenuItemForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: UCSBDiningCommonMenuItemForm tests renders correctly when passing in a UCSBDiningCommonMenuItem
statusReason: Unable to find an element by: [data-testid="/UCSBDiningCommonMenuItemForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
